Revit 2016 API
ExporterIFC.GetSite Method
 Gets the global IfcSite object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2013
Syntax
C#
public IFCAnyHandle GetSite()
Visual Basic
Public Function GetSite As IFCAnyHandle
Visual C++
public:
IFCAnyHandle^ GetSite()
Return Value
 The handle.
See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace